#Задача 1:Возведите число в квадрат
print('Введите число')
a = int(input())
print('Введите степень')
b = int(input())
step = a**b
print(step)